## Set up environment

In [18]:
import os
import pandas as pd

In [7]:
os.path.normpath(os.getcwd() + os.sep + os.pardir) +

'/Users/caseyhaseloff/Documents/EDP_assigment2'

In [14]:
path = os.path.join(os.path.normpath(os.getcwd() + os.sep + os.pardir) + "/data/raw")

In [17]:
os.listdir(path)

['BX-NewBooksUsers.csv',
 'BX-Books.csv',
 'BX-Ratings.csv',
 'BX-Users.csv',
 'BX-NewBooksRatings.csv',
 'BX-NewBooks.csv']

## Begin looking into books

In [65]:
books = pd.read_csv(path + "/BX-Books.csv")
books.columns

Index(['ISBN', 'Book-Title', 'Book-Author', 'Year-Of-Publication',
       'Book-Publisher'],
      dtype='object')

In [66]:
books["Book-Author"].value_counts().head(10)

Book-Author
Stephen King          193
Nora Roberts          123
Anne McCaffrey         81
Danielle Steel         74
Piers Anthony          70
V.C. Andrews           66
Terry Pratchett        65
Mary Higgins Clark     63
Sandra Brown           63
Agatha Christie        57
Name: count, dtype: int64

In [67]:
books["Year-Of-Publication"].value_counts().head(10)

Year-Of-Publication
2002    1750
2001    1572
2003    1530
2000    1384
1999    1346
1998    1136
1997    1064
1996    1012
1995     935
1994     842
Name: count, dtype: int64

## Look at users

In [68]:
users = pd.read_csv(path + "/BX-Users.csv")
users.columns

Index(['User-ID', 'User-City', 'User-State', 'User-Country', 'User-Age'], dtype='object')

In [69]:
users.shape

(48299, 5)

In [70]:
users

       User-ID    User-City   User-State User-Country User-Age
0            8      timmins      ontario      canada"      NaN
1            9   germantown    tennessee         usa"      NaN
2           16  albuquerque   new mexico         usa"      NaN
3           17   chesapeake     virginia         usa"      NaN
4           19       weston                       NaN      14"
...        ...          ...          ...          ...      ...
48294   278846      toronto      ontario      canada"       23
48295   278849   georgetown      ontario      canada"       23
48296   278851       dallas        texas         usa"       33
48297   278852     brisbane   queensland   australia"       32
48298   278854     portland       oregon         usa"      NaN

[48299 rows x 5 columns]

In [71]:
users[users["User-Age"].isna()]

       User-ID       User-City   User-State User-Country User-Age
0            8         timmins      ontario      canada"      NaN
1            9      germantown    tennessee         usa"      NaN
2           16     albuquerque   new mexico         usa"      NaN
3           17      chesapeake     virginia         usa"      NaN
5           26        bellevue   washington         usa"      NaN
...        ...             ...          ...          ...      ...
48280   278786  st. catharines      ontario      canada"      NaN
48287   278825        portland       oregon         usa"      NaN
48288   278828      germantown     illinois         usa"      NaN
48289   278831       anchorage       alaska         usa"      NaN
48298   278854        portland       oregon         usa"      NaN

[18952 rows x 5 columns]

In [72]:
users[users["User-City"].isna()]

       User-ID User-City        User-State   User-Country User-Age
385       2197       NaN        travelling        canada"       26
616       3569       NaN               n/a           usa"      NaN
731       4221       NaN       connecticut           usa"      NaN
1904     11676       NaN               n/a           n/a"      NaN
2107     12966       NaN               n/a     singapore"       28
...        ...       ...               ...            ...      ...
44878   258650       NaN   new south wales     australia"      NaN
45769   264128       NaN               n/a       austria"      NaN
45889   264846       NaN               n/a   netherlands"        6
47048   271186       NaN        new jersey           usa"      NaN
47963   277124       NaN                          canada"      NaN

[61 rows x 5 columns]

In [73]:
users[users["User-State"].isna()]

Empty DataFrame
Columns: [User-ID, User-City, User-State, User-Country, User-Age]
Index: []

In [74]:
users[users["User-Country"].isna()]

       User-ID        User-City   User-State User-Country User-Age
4           19           weston                       NaN      14"
133        777         portland                       NaN      13"
160        929  king of prussia                       NaN      36"
198       1131         berkeley                       NaN      22"
284       1589             clio     michigan          NaN      50"
...        ...              ...          ...          ...      ...
47674   275358           pueblo                       NaN      15"
47827   276240           smyrna                       NaN      28"
47865   276496       the colony                       NaN      45"
47869   276538          cologne                       NaN      26"
47870   276545         deventer   overijssel          NaN      38"

[669 rows x 5 columns]

## Look at ratings

In [81]:
ratings = pd.read_csv(path + "/BX-Ratings.csv")
ratings.columns

Index(['User-ID', 'ISBN', 'Book-Rating'], dtype='object')